Repository: eliashaeussler/typo3-form-consent
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# consentMail.subject
source: Approve your consent
de: Bestätigen Sie Ihre Einwilligung

# consentMail.title
source: Please approve your consent
de: Bitte bestätigen Sie Ihre Einwilligung

# consentMail.salutation
source: Hello %s
de: Hallo %s

# consentMail.body.approve
source: your consent was registered successfully. Please click the following link to approve it:
de: Ihre Einwilligung wurde erfolgreich registriert. Bitte klicken Sie auf den folgenden Link, um sie zu bestätigen:

# consentMail.body.dismiss
source: If you feel this consent was given by accident or if you want to dismiss it, please click the following link:
de: Wenn Sie der Meinung sind, diese Einwilligung wurde gegen Ihren Willen gegeben, oder wenn Sie die Einwilligung ablehnen möchten, klicken Sie bitte auf den folgenden Link:

# consentMail.error
source: The consent mail could not be sent.
de: Die Zustimmungsmail konnte nicht gesendet werden.

# consent.approve.error.invalidConsent.title
source: Invalid link
de: Ungültiger Link

# consent.approve.error.invalidConsent.body
source: The link you clicked is no longer valid or has already been clicked. Please fill out the form again.
de: Der Link, auf den Sie geklickt haben, ist nicht mehr gültig oder wurde bereits angeklickt. Bitte füllen Sie das Formular erneut aus.

# consent.approve.error.invalidEmail.title
source: Invalid email address
de: Ungültige E-Mail-Adresse

# consent.approve.error.invalidEmail.body
source: The email address sent with the link is not valid. Please fill out the form again.
de: Die mit dem Link übermittelte E-Mail-Adresse ist nicht gültig. Bitte füllen Sie das Formular erneut aus.

# consent.approve.error.alreadyApproved.title
source: Consent already given
de: Zustimmung bereits erteilt

# consent.approve.error.alreadyApproved.body
source: The link you clicked has already been clicked. This means that consent has already been given and the link is no longer valid.
de: Der Link, auf den Sie geklickt haben, wurde bereits angeklickt. Die Zustimmung wurde dadurch bereits erteilt und der Link ist nicht mehr gültig.

# consent.approve.error.unknown.title
source: Unknown error
de: Unbekannter Fehler

# consent.approve.error.unknown.body
source: An unknown error has occurred. Please try clicking the link from the email again. If the problem persists, please fill out the form again.
de: Ein unbekannter Fehler ist aufgetreten. Bitte klicken Sie erneut auf den Link aus der E-Mail. Wenn das Problem weiterhin besteht, füllen Sie bitte das Formular erneut aus.

# consent.approve.success.title
source: Consent successful
de: Zustimmung erfolgreich

# consent.approve.success.body
source: Thank you, your approval was successful. You can now delete the email.
de: Vielen Dank, Ihre Genehmigung war erfolgreich. Sie können nun die E-Mail löschen.

# consent.dismiss.error.invalidConsent.title
source: Invalid link
de: Ungültiger Link

# consent.dismiss.error.invalidConsent.body
source: The link you clicked is no longer valid or has already been clicked.
de: Der Link, den Sie geklickt haben, ist nicht mehr gültig oder wurde bereits angeklickt.

# consent.dismiss.error.invalidEmail.title
source: Invalid email address
de: Ungültige E-Mail-Adresse

# consent.dismiss.error.invalidEmail.body
source: The email address sent with the link is not valid. Please fill out the form again.
de: Die mit dem Link übermittelte E-Mail-Adresse ist nicht gültig. Bitte füllen Sie das Formular erneut aus.

# consent.dismiss.error.unknown.title
source: Unknown error
de: Unbekannter Fehler

# consent.dismiss.error.unknown.body
source: An unknown error has occurred. Please try clicking the link from the email again. If the problem persists, please fill out the form again.
de: Ein unbekannter Fehler ist aufgetreten. Bitte klicken Sie erneut auf den Link aus der E-Mail. Wenn das Problem weiterhin besteht, füllen Sie bitte das Formular erneut aus.

# consent.dismiss.success.title
source: Consent successfully revoked
de: Zustimmung erfolgreich widerrufen

# consent.dismiss.success.body
source: You have successfully revoked your consent. You can now delete the email.
de: Sie haben Ihre Zustimmung erfolgreich widerrufen. Sie können die E-Mail nun löschen.
