Repository: eliashaeussler/typo3-form-consent
Catalog: Resources/Private/Language/*.locallang_form.xlf
Languages: de

# formEditor.elements.Form.editor.finishers.Consent.label
source: Consent
de: Einwilligung

# formEditor.elements.Form.finishers.Consent.editor.default.label
source: Consent
de: Einwilligung

# formEditor.elements.Form.finishers.Consent.editor.subject.label
source: Subject
de: Betreff

# formEditor.elements.Form.finishers.Consent.editor.recipientAddress.label
source: Recipient e-mail address
de: E-Mail-Adresse des Empfängers

# formEditor.elements.Form.finishers.Consent.editor.recipientName.label
source: Recipient name
de: Name des Empfängers

# formEditor.elements.Form.finishers.Consent.editor.senderAddress.label
source: Sender e-mail address
de: Absender-E-Mail-Adresse

# formEditor.elements.Form.finishers.Consent.editor.senderName.label
source: Sender name
de: Name des Absenders

# formEditor.elements.Form.finishers.Consent.editor.approvalPeriod.label
source: Approval period
de: Zustimmungszeitraum

source: Time period in seconds where consent can be given. Set this value to "0" to allow unlimited approval.
de: Zeitraum in Sekunden, in dem die Zustimmung erteilt werden kann. Setzen Sie diesen Wert auf "0", um eine unbefristete Zustimmung zu ermöglichen.

# formEditor.elements.Form.finishers.Consent.editor.showDismissLink.label
source: Show dismiss link
de: Link zum Ablehnen mitsenden

source: Enable this checkbox if users should be able to dismiss their consent.
de: Aktivieren Sie dieses Kästchen, wenn Benutzer ihre Einwilligung verwerfen können.

# formEditor.elements.Form.finishers.Consent.editor.confirmationPid.label
source: Confirmation page
de: Bestätigungsseite

# formEditor.elements.Form.finishers.Consent.editor.confirmationPid.buttonLabel
source: Page
de: Seite

# formEditor.elements.Form.finishers.Consent.editor.storagePid.label
source: Storage page
de: Datensatz-Speicherort

# formEditor.elements.Form.finishers.Consent.editor.storagePid.buttonLabel
source: Page
de: Seite

# formEditor.elements.Form.finisher.Consent.editor.header.label
source: Consent
de: Einwilligung

# tt_content.finishersDefinition.Consent.label
source: Consent
de: Einwilligung

# tt_content.finishersDefinition.Consent.subject.label
source: Subject
de: Betreff

# tt_content.finishersDefinition.Consent.recipientAddress.label
source: Recipient e-mail address
de: E-Mail-Adresse des Empfängers

# tt_content.finishersDefinition.Consent.recipientName.label
source: Recipient name
de: Name des Empfängers

# tt_content.finishersDefinition.Consent.senderAddress.label
source: Sender e-mail address
de: Absender-E-Mail-Adresse

# tt_content.finishersDefinition.Consent.senderName.label
source: Sender name
de: Name des Absenders

# tt_content.finishersDefinition.Consent.approvalPeriod.label
source: Approval period
de: Zustimmungszeitraum

# tt_content.finishersDefinition.Consent.showDismissLink.label
source: Show dismiss link
de: Link zum Ablehnen mitsenden

# tt_content.finishersDefinition.Consent.confirmationPid.label
source: Confirmation page
de: Bestätigungsseite

# tt_content.finishersDefinition.Consent.storagePid.label
source: Storage page
de: Datensatz-Speicherort

# validation.recipientAddress.empty
source: The finisher option "recipientAddress" must be set.
de: Die Finisher-Option "recipientAddress" muss gesetzt sein.

# validation.recipientAddress.invalid
source: The finisher option "recipientAddress" must contain a valid e-mail address.
de: Die Finisher-Option "recipientAddress" muss eine gültige E-Mail Adresse enthalten.

# validation.senderAddress.invalid
source: The finisher option "senderAddress" must contain a valid e-mail address.
de: Die Finisher-Option "senderAddress" muss eine gültige E-Mail Adresse enthalten.

# validation.validationPeriod.invalid
source: The finisher option "validationPeriod" must be zero or more seconds.
de: Die Finisher-Option "validationPeriod" muss 0 oder mehr Sekunden betragen.

# validation.confirmationPid.empty
source: The finisher option "confirmationPid" must be set.
de: Die Finisher-Option "confirmationPid" muss gesetzt sein.

# validation.confirmationPid.invalid
source: The finisher option "confirmationPid" must be set to a valid page.
de: Die Finisher-Option "confirmationPid" muss auf eine gültige Seite gesetzt werden.

# validation.storagePid.empty
source: The finisher option "storagePid" must be set.
de: Die Finisher-Option "storagePid" muss gesetzt sein.

# validation.storagePid.invalid
source: The finisher option "storagePid" must be set to a valid page.
de: Die Finisher-Option "storagePid" muss auf eine gültige Seite gesetzt werden.
